УТ.УчетЗадач/src/DataProcessors/cbr_ВводНачальныхНастроек/cbr_ВводНачальныхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>cbr_ВводНачальныхНастроек</name>
</mdclass:DataProcessor>

УТ.УчетЗадач/src/InformationRegisters/cbr_ИсполнителиЗадач/cbr_ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ИсполнителиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.cbr_Роли</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.cbr_ГруппыДоступаКЗадачам</types>
    </type>
  </resources>
  <resources>
    <name>ЗадачаВзята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_СтатусыЗадач/cbr_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_СтатусыЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.cbr_СтатусыЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ВопросыПоЗадачам/cbr_ВопросыПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ВопросыПоЗадачам</name>
  <resources>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидВопроса</name>
    <type>
      <types>EnumRef.cbr_ВидыВопросов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ДедлайнЗадач/cbr_ДедлайнЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ДедлайнЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ОценкаЧасов/cbr_ОценкаЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ОценкаЧасов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОценки</name>
    <type>
      <types>EnumRef.cbr_ТипОценкиЧасов</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/cbr_ПодпискаДляТриггера/cbr_ПодпискаДляТриггера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ПодпискаДляТриггера</name>
  <enumValues>
    <name>ПроведениеДокументаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервереФормыЗадачи</name>
  </enumValues>
  <enumValues>
    <name>КнопкаЗакрытияЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаВопросПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВопросаПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Enums/cbr_СостояниеЗаписиРабочегоКалендаря/cbr_СостояниеЗаписиРабочегоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_СостояниеЗаписиРабочегоКалендаря</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Запланированна</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>ПоПлану</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Enums/cbr_ВидыВопросов/cbr_ВидыВопросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ВидыВопросов</name>
  <enumValues>
    <name>Вопрос</name>
  </enumValues>
  <enumValues>
    <name>Ответ</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Documents/cbr_Задача/cbr_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.cbr_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.cbr_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетКонтроляПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.cbr_МеткиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.cbr_ПричиныЗакрытияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.cbr_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ.УчетЗадач/src/DataProcessors/cbr_ВводНачальныхНастроек/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыполнитьНастройку(Команда)
	Оповещение = Новый ОписаниеОповещения("ОбработатьОтвет", ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение, "Триггеры и этапу контроля будут сброшены. Продолжить?", РежимДиалогаВопрос.ДаНетОтмена,
		0, КодВозвратаДиалога.Нет);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОчиститьСправочники()
	Выборка = Справочники.cbr_СтатусыЗадач.Выбрать();
	Пока Выборка.Следующий() Цикл
	   ОбъектСправочника = Выборка.ПолучитьОбъект();
	   ОбъектСправочника.Удалить();
	КонецЦикла;
	
	Выборка = Справочники.cbr_Триггеры.Выбрать();
	Пока Выборка.Следующий() Цикл
	   ОбъектСправочника = Выборка.ПолучитьОбъект();
	   ОбъектСправочника.Удалить();
	КонецЦикла;
	
	Выборка = Справочники.cbr_КонтрольНадЭтапамиЗадач.Выбрать();
	Пока Выборка.Следующий() Цикл
	   ОбъектСправочника = Выборка.ПолучитьОбъект();
	   ОбъектСправочника.Удалить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтвет(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Попытка
        	ВыполнитьНастройкуНаСервере();
        	ОбщегоНазначенияКлиент.СообщитьПользователю("Настройки успешно применены");
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю("Произошла ошибка применения настроек");
		КонецПопытки;
	Иначе
		Закрыть();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьНастройкуНаСервере()
	ОчиститьСправочники();
	
	Статусы = СоздатьСтатусы();
	
	СтруктурыТриггеров = СформироватьСтруктурыТриггеров(Статусы);
	СоздатьТриггеры(СтруктурыТриггеров);
	
	СтруктурыЭтапов = СформироватьСтруктурыЭтапов(Статусы);
	СоздатьЭтапы(СтруктурыЭтапов);
КонецПроцедуры

&НаСервере
Функция СоздатьСтатусы()
	Статусы = Новый Структура();
	
	НаИсполнителе = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	НаИсполнителе.Наименование = "На исполнителе";
	НаИсполнителе.Записать();
	Статусы.Вставить("НаИсполнителе", НаИсполнителе.Ссылка);
	
	ВРаботе = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	ВРаботе.Наименование = "В работе";
	ВРаботе.Записать();
	Статусы.Вставить("ВРаботе", ВРаботе.Ссылка);
	
	Закрыта = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	Закрыта.Наименование = "Закрыта";
	Закрыта.Закрыт = Истина;
	Закрыта.Записать();
	Статусы.Вставить("Закрыта", Закрыта.Ссылка);
	
	Запланирована = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	Запланирована.Наименование = "Запланирована";
	Запланирована.Записать();
	Статусы.Вставить("Запланирована", Запланирована.Ссылка);
	
	ЗапросИнформации = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	ЗапросИнформации.Наименование = "Запрос информации";
	ЗапросИнформации.Записать();
	Статусы.Вставить("ЗапросИнформации", ЗапросИнформации.Ссылка);
	
	ЗапросИнформацииЗакрытой = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	ЗапросИнформацииЗакрытой.Наименование = "Запрос информации закрытой";
	ЗапросИнформацииЗакрытой.Закрыт = Истина;
	ЗапросИнформацииЗакрытой.Записать();
	Статусы.Вставить("ЗапросИнформацииЗакрытой", ЗапросИнформацииЗакрытой.Ссылка);
	
	НаМенеджере = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	НаМенеджере.Наименование = "На Менеджере";
	НаМенеджере.Записать();
	Статусы.Вставить("НаМенеджере", НаМенеджере.Ссылка);
	
	Новая = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	Новая.Наименование = "Новая";
	Новая.Новый = Истина;
	Новая.Записать();
	Статусы.Вставить("Новая", Новая.Ссылка);
	
	ОжиданиеГлавной = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	ОжиданиеГлавной.Наименование = "Ожидание главной";
	ОжиданиеГлавной.Записать();
	Статусы.Вставить("ОжиданиеГлавной", ОжиданиеГлавной.Ссылка);
	
	ОзнакомленИсполнитель = Справочники.cbr_СтатусыЗадач.СоздатьЭлемент();
	ОзнакомленИсполнитель.Наименование = "Ознакомлен исполнитель";
	ОзнакомленИсполнитель.Записать();
	Статусы.Вставить("ОзнакомленИсполнитель", ОзнакомленИсполнитель.Ссылка);
	
	Возврат Статусы;
КонецФункции

&НаСервере
Функция СформироватьСтруктурыТриггеров(Статусы)
	Триггеры = Новый Массив;
	Триггер = Новый Структура;
	ПараметрыТриггера = Новый Массив;
	
	Триггер.Вставить("Наименование", "Взята в работу");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.КнопкаВзятьЗадачу"));
	Триггер.Вставить("ФорматнаяСтрока", "Пользователь: &Исполнитель взял задачу "" &Наименование "" себе.");
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.НаИсполнителе));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_ИсполнителиЗадачСрезПоследних
	|		ПО cbr_Задача.Ссылка = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_СтатусыЗадачСрезПоследних
	|		ПО cbr_Задача.Ссылка = cbr_СтатусыЗадачСрезПоследних.Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|	И cbr_СтатусыЗадачСрезПоследних.Статус <> &Статус");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Возврат главной в работу (Главная)");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.КнопкаВернутьВышестоящуюВРаботу"));
	Триггер.Вставить("ФорматнаяСтрока", "Задача "" &Наименование "" верулась на &Пользователь т.к. "" &ТекстВопроса "".");
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.ОжиданиеГлавной));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.ГлавнаяЗадача КАК ГлавнаяЗадача
	|ПОМЕСТИТЬ вт_ГлавнаяЗадача
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_ВопросыПоЗадачам.ТекстВопроса КАК ТекстВопроса,
	|	cbr_ВопросыПоЗадачам.Дата КАК Дата,
	|	вт_ГлавнаяЗадача.ГлавнаяЗадача КАК ГлавнаяЗадача
	|ПОМЕСТИТЬ вт_Вопросы
	|ИЗ
	|	вт_ГлавнаяЗадача КАК вт_ГлавнаяЗадача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО вт_ГлавнаяЗадача.ГлавнаяЗадача = cbr_ВопросыПоЗадачам.Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(вт_Вопросы.Дата) КАК Дата
	|ПОМЕСТИТЬ вт_МаксДатаВопроса
	|ИЗ
	|	вт_Вопросы КАК вт_Вопросы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Вопросы.ТекстВопроса КАК ТекстВопроса,
	|	вт_Вопросы.ГлавнаяЗадача КАК ГлавнаяЗадача
	|ПОМЕСТИТЬ вт_Вопрос
	|ИЗ
	|	вт_МаксДатаВопроса КАК вт_МаксДатаВопроса
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Вопросы КАК вт_Вопросы
	|		ПО вт_МаксДатаВопроса.Дата = вт_Вопросы.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Ссылка,
	|	cbr_Задача.Наименование КАК Наименование,
	|	вт_Вопрос.ТекстВопроса КАК ТекстВопроса,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Пользователь
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача В
	|		(ВЫБРАТЬ
	|			вт_ГлавнаяЗадача.ГлавнаяЗадача
	|		ИЗ
	|			вт_ГлавнаяЗадача КАК вт_ГлавнаяЗадача)) КАК cbr_СтатусыЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача В
	|			(ВЫБРАТЬ
	|				вт_ГлавнаяЗадача.ГлавнаяЗадача
	|			ИЗ
	|				вт_ГлавнаяЗадача КАК вт_ГлавнаяЗадача)) КАК cbr_ИсполнителиЗадачСрезПоследних
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Вопрос КАК вт_Вопрос
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = вт_Вопрос.ГлавнаяЗадача
	|ГДЕ
	|	cbr_СтатусыЗадачСрезПоследних.Статус = &Статус");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Возврат главной в работу (Подчиненная)");
	Триггер.Вставить("Владелец", Статусы.ОжиданиеГлавной);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.КнопкаВернутьВышестоящуюВРаботу"));
	Триггер.Вставить("ФорматнаяСтрока", "Пользователь: &Исполнитель возвращает вышестоящую задачу в работу, от задачи "" &Наименование "".");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_ИсполнителиЗадачСрезПоследних
	|		ПО cbr_Задача.Ссылка = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Главная завершилась");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.КнопкаЗакрытияЗадачи"));
	Триггер.Вставить("ФорматнаяСтрока", "Задача "" &Наименование "" вернулась на вас после завершения вышестоящей задачи.");
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.ОжиданиеГлавной));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ вт_ПодчиненныеЗадачи
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.ГлавнаяЗадача = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача
	|ПОМЕСТИТЬ вт_Статусы
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача В
	|		(ВЫБРАТЬ
	|			вт_Подчиненные.Ссылка
	|		ИЗ
	|			вт_Подчиненные КАК вт_Подчиненные)) КАК cbr_СтатусыЗадачСрезПоследних
	|ГДЕ
	|	cbr_СтатусыЗадачСрезПоследних.Статус = &Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Статусы.Задача КАК Ссылка,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Пользователь,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	вт_Статусы КАК вт_Статусы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача В
	|			(ВЫБРАТЬ
	|				вт_Статусы.Задача
	|			ИЗ
	|				вт_Статусы КАК вт_Статусы)) КАК cbr_ИсполнителиЗадачСрезПоследних
	|		ПО вт_Статусы.Задача = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_Статусы.Задача = cbr_Задача.Ссылка");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Новая задача");
	Триггер.Вставить("Владелец", Статусы.Новая);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПроведениеДокументаЗадача"));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|		КОГДА НЕ cbr_СтатусыЗадачСрезПоследних.Статус ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Количество,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Менеджер,
	|	cbr_Задача.Ссылка КАК Задача
	|ПОМЕСТИТЬ вт_ПроверкаНаПервыйСтатус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ,
	|	cbr_Задача.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА вт_ПроверкаНаПервыйСтатус.Количество = 0
	|			ТОГДА &Задача
	|	КОНЕЦ КАК Ссылка
	|ИЗ
	|	вт_ПроверкаНаПервыйСтатус КАК вт_ПроверкаНаПервыйСтатус");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Закрытие задачи");
	Триггер.Вставить("Владелец", Статусы.Закрыта);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.КнопкаЗакрытияЗадачи"));
	Триггер.Вставить("ФорматнаяСтрока", "Задача "" &Наименование "" закрыта.");
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.Закрыта));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус,
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	вт_Статус КАК вт_Статус
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_Статус.Задача = cbr_Задача.Ссылка
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Запланировано действие по задаче");
	Триггер.Вставить("Владелец", Статусы.Запланирована);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПослеЗаписиСобытияКалендаря"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.Запланирована));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.ВРаботе)
	|			ТОГДА 2
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Состояние,
	|	cbr_Календарь.Предмет КАК Задача
	|ПОМЕСТИТЬ вт_Состояния
	|ИЗ
	|	Справочник.cbr_Календарь КАК cbr_Календарь
	|ГДЕ
	|	cbr_Календарь.Предмет = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Календарь.Предмет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт_Состояния.Состояние, 0) КАК Состояние
	|ПОМЕСТИТЬ вт_Итоговая
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Состояния КАК вт_Состояния
	|		ПО cbr_Задача.Ссылка = вт_Состояния.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Статус КАК вт_Статус
	|		ПО cbr_Задача.Ссылка = вт_Статус.Задача
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итоговая.Ссылка КАК Ссылка,
	|	вт_Итоговая.Пользователь КАК Пользователь
	|ИЗ
	|	вт_Итоговая КАК вт_Итоговая
	|ГДЕ
	|	вт_Итоговая.Состояние = 1");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Запрос информации");
	Триггер.Вставить("Владелец", Статусы.ЗапросИнформации);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.СозданиеВопросаПоЗадаче"));
	Триггер.Вставить("ФорматнаяСтрока", "Запрос Информации по задаче "" &Наименование "" от пользователя &Отправитель - "" &ТекстВопроса "".");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	МАКСИМУМ(cbr_ВопросыПоЗадачам.Дата) КАК Дата
	|ПОМЕСТИТЬ вт_Задача
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО cbr_ВопросыПоЗадачам.Задача = cbr_Задача.Ссылка
	|		И cbr_ВопросыПоЗадачам.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.cbr_ВИдыВопросов.Вопрос)
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Задача.Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Задача.Ссылка КАК Ссылка,
	|	cbr_ВопросыПоЗадачам.Отправитель КАК Отправитель,
	|	cbr_ВопросыПоЗадачам.ТекстВопроса КАК ТекстВопроса,
	|	cbr_Задача.Наименование КАК Наименование,
	|	cbr_ВопросыПоЗадачам.Адресат КАК Пользователь
	|ИЗ
	|	вт_Задача КАК вт_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО вт_Задача.Ссылка = cbr_ВопросыПоЗадачам.Задача
	|		И вт_Задача.Дата = cbr_ВопросыПоЗадачам.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_Задача.Ссылка = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_СтатусыЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|			ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ПО вт_Задача.Ссылка = cbr_СтатусыЗадачСрезПоследних.Задача
	|ГДЕ
	|	НЕ cbr_СтатусыЗадач.Закрыт");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Запрос информации закрытой");
	Триггер.Вставить("Владелец", Статусы.ЗапросИнформацииЗакрытой);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.СозданиеВопросаПоЗадаче"));
	Триггер.Вставить("ФорматнаяСтрока", "Запрос Информации по закрытой задаче "" &Наименование "" от пользователя &Отправитель - "" &ТекстВопроса "".");
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.Закрыта));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	МАКСИМУМ(cbr_ВопросыПоЗадачам.Дата) КАК Дата
	|ПОМЕСТИТЬ вт_Задача
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО cbr_ВопросыПоЗадачам.Задача = cbr_Задача.Ссылка
	|		И cbr_ВопросыПоЗадачам.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.cbr_ВИдыВопросов.Вопрос)
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Задача.Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Задача.Ссылка КАК Ссылка,
	|	cbr_ВопросыПоЗадачам.Отправитель КАК Отправитель,
	|	cbr_ВопросыПоЗадачам.ТекстВопроса КАК ТекстВопроса,
	|	cbr_Задача.Наименование КАК Наименование,
	|	cbr_ВопросыПоЗадачам.Адресат КАК Пользователь
	|ИЗ
	|	вт_Задача КАК вт_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО вт_Задача.Ссылка = cbr_ВопросыПоЗадачам.Задача
	|		И вт_Задача.Дата = cbr_ВопросыПоЗадачам.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_Задача.Ссылка = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_СтатусыЗадачСрезПоследних
	|		ПО вт_Задача.Ссылка = cbr_СтатусыЗадачСрезПоследних.Задача
	|ГДЕ
	|	cbr_СтатусыЗадачСрезПоследних.Статус = &Статус");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Запрос на согласование дедлайна");
	Триггер.Вставить("Владелец", Статусы.НаМенеджере);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ОтправкаДедлайнаНаСогласование"));
	Триггер.Вставить("ФорматнаяСтрока", "Запрос на согласование Дедлайна задачи &Наименование от &Согласовант. Дедлайн: &Дедлайн.");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Наименование КАК Наименование,
	|	cbr_ДедлайнЗадачСрезПоследних.Дедлайн КАК Дедлайн,
	|	ВЫБОР
	|		КОГДА cbr_ДедлайнЗадачСрезПоследних.Согласовано
	|			ТОГДА ""Согласовано""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Согласовано,
	|	ВЫБОР
	|		КОГДА cbr_ДедлайнЗадачСрезПоследних.Отказ
	|			ТОГДА cbr_ДедлайнЗадачСрезПоследних.КомментарийОтказа
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Отказ,
	|	cbr_ДедлайнЗадачСрезПоследних.Согласовант КАК Согласовант
	|ИЗ
	|	РегистрСведений.cbr_ДедлайнЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_ДедлайнЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО cbr_ДедлайнЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|	И cbr_ДедлайнЗадачСрезПоследних.Согласующий <> cbr_ДедлайнЗадачСрезПоследних.Согласовант");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Запрос на согласование оценки");
	Триггер.Вставить("Владелец", Статусы.НаМенеджере);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ОтправкаОценкиНаСогласование"));
	Триггер.Вставить("ФорматнаяСтрока", "Запрос на согласование оценки задачи "" &Наименование "" от &Согласовант. Тип Оценки: &ТипОценки, &От &До, оцененная длительность &Длительность");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_ОценкаЧасовСрезПоследних.От КАК От,
	|	cbr_ОценкаЧасовСрезПоследних.До КАК До,
	|	cbr_ОценкаЧасовСрезПоследних.Длительность КАК Длительность,
	|	cbr_ОценкаЧасовСрезПоследних.Согласовант КАК Согласовант,
	|	cbr_ОценкаЧасовСрезПоследних.ТипОценки КАК ТипОценки,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ОценкаЧасов.СрезПоследних(, Задача = &Задача) КАК cbr_ОценкаЧасовСрезПоследних
	|		ПО cbr_ОценкаЧасовСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|	И cbr_ОценкаЧасовСрезПоследних.Согласовант <> cbr_ОценкаЧасовСрезПоследних.Согласующий");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Исполнитель ознакомлен с задачей");
	Триггер.Вставить("Владелец", Статусы.ОзнакомленИсполнитель);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПриСозданииНаСервереФормыЗадачи"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.Новая));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_ИсполнителиЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Исполнитель,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_ИсполнительСтатус
	|ИЗ
	|	РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_ИсполнителиЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_СтатусыЗадачСрезПоследних
	|		ПО cbr_ИсполнителиЗадачСрезПоследних.Задача = cbr_СтатусыЗадачСрезПоследних.Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ИсполнительСтатус.Задача КАК Ссылка,
	|	cbr_Задача.Автор КАК Пользователь
	|ИЗ
	|	вт_ИсполнительСтатус КАК вт_ИсполнительСтатус
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_ИсполнительСтатус.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	вт_ИсполнительСтатус.Исполнитель = &ТекущийПользователь
	|	И вт_ИсполнительСтатус.Статус = &Статус");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После завершения события");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПослеЗаписиСобытияКалендаря"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.НаИсполнителе));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.ВРаботе)
	|			ТОГДА 2
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Состояние,
	|	cbr_Календарь.Предмет КАК Задача
	|ПОМЕСТИТЬ вт_Состояния
	|ИЗ
	|	Справочник.cbr_Календарь КАК cbr_Календарь
	|ГДЕ
	|	cbr_Календарь.Предмет = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Календарь.Предмет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт_Состояния.Состояние, 0) КАК Состояние
	|ПОМЕСТИТЬ вт_Итоговая
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Состояния КАК вт_Состояния
	|		ПО cbr_Задача.Ссылка = вт_Состояния.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Статус КАК вт_Статус
	|		ПО cbr_Задача.Ссылка = вт_Статус.Задача
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итоговая.Ссылка КАК Ссылка,
	|	вт_Итоговая.Пользователь КАК Пользователь
	|ИЗ
	|	вт_Итоговая КАК вт_Итоговая
	|ГДЕ
	|	вт_Итоговая.Состояние = 0");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После ответа на вопрос");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ОтветНаВопросПоЗадаче"));
	Триггер.Вставить("ФорматнаяСтрока", "Пришел ответ на вопрос по задаче "" &Наименование "" от пользователя &Отправитель - "" &ТекстВопроса "".");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_СтатусыЗадач.Закрыт КАК Закрыт,
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	МАКСИМУМ(cbr_ВопросыПоЗадачам.Дата) КАК Дата
	|ПОМЕСТИТЬ вт_ПоследнийСтатус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|		ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_ВопросыПоЗадачам.Задача
	|		И cbr_ВопросыПоЗадачам.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.cbr_ВидыВопросов.Ответ)
	|СГРУППИРОВАТЬ ПО
	|	cbr_СтатусыЗадач.Закрыт,
	|	cbr_СтатусыЗадачСрезПоследних.Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_Задача.Наименование КАК Наименование,
	|	cbr_ВопросыПоЗадачам.Адресат КАК Пользователь,
	|	cbr_ВопросыПоЗадачам.Отправитель КАК Отправитель,
	|	cbr_ВопросыПоЗадачам.ТекстВопроса КАК ТекстВопроса,
	|	cbr_Задача.Ссылка КАК Ссылка
	|ИЗ
	|	вт_ПоследнийСтатус КАК вт_ПоследнийСтатус
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_ПоследнийСтатус.Задача = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО вт_ПоследнийСтатус.Задача = cbr_ВопросыПоЗадачам.Задача
	|		И cbr_ВопросыПоЗадачам.Дата = вт_ПоследнийСтатус.Дата
	|ГДЕ
	|	НЕ вт_ПоследнийСтатус.Закрыт");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После ответа на вопрос по закрытой");
	Триггер.Вставить("Владелец", Статусы.Закрыта);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ОтветНаВопросПоЗадаче"));
	Триггер.Вставить("ФорматнаяСтрока", "Пришел ответ на вопрос по закрытой задаче "" &Наименование "" от пользователя &Отправитель - "" &ТекстВопроса "".");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_СтатусыЗадач.Закрыт КАК Закрыт,
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	МАКСИМУМ(cbr_ВопросыПоЗадачам.Дата) КАК Дата
	|ПОМЕСТИТЬ вт_ПоследнийСтатус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|		ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_ВопросыПоЗадачам.Задача
	|		И cbr_ВопросыПоЗадачам.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.cbr_ВидыВопросов.Ответ)
	|СГРУППИРОВАТЬ ПО
	|	cbr_СтатусыЗадач.Закрыт,
	|	cbr_СтатусыЗадачСрезПоследних.Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_Задача.Наименование КАК Наименование,
	|	cbr_ВопросыПоЗадачам.Адресат КАК Пользователь,
	|	cbr_ВопросыПоЗадачам.Отправитель КАК Отправитель,
	|	cbr_ВопросыПоЗадачам.ТекстВопроса КАК ТекстВопроса,
	|	cbr_Задача.Ссылка КАК Ссылка
	|ИЗ
	|	вт_ПоследнийСтатус КАК вт_ПоследнийСтатус
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО вт_ПоследнийСтатус.Задача = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО вт_ПоследнийСтатус.Задача = cbr_ВопросыПоЗадачам.Задача
	|		И cbr_ВопросыПоЗадачам.Дата = вт_ПоследнийСтатус.Дата
	|ГДЕ
	|	вт_ПоследнийСтатус.Закрыт");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После согласования дедлайна");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.СогласованиеДедлайна"));
	Триггер.Вставить("ФорматнаяСтрока", "Ответ на согласование дедлайна(&Дедлайн) по задаче "" &Наименование "": &Согласовано &Отказ.");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_ИсполнителиЗадачСрезПоследних.Задача КАК Ссылка,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Пользователь,
	|	cbr_ДедлайнЗадачСрезПоследних.Дедлайн КАК Дедлайн,
	|	ВЫБОР
	|		КОГДА cbr_ДедлайнЗадачСрезПоследних.Согласовано
	|			ТОГДА ""Согласовано""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Согласовано,
	|	ВЫБОР
	|		КОГДА cbr_ДедлайнЗадачСрезПоследних.Отказ
	|			ТОГДА ""Согласовано""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Отказ,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_ИсполнителиЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|			ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ДедлайнЗадач.СрезПоследних(, Задача = &Задача) КАК
	|				cbr_ДедлайнЗадачСрезПоследних
	|			ПО cbr_ДедлайнЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|		ПО cbr_ИсполнителиЗадачСрезПоследних.Задача = cbr_Задача.Ссылка");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После согласования оценки");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.СогласованиеОценки"));
	Триггер.Вставить("ФорматнаяСтрока", "Пришел ответ по согласованию оценки задачи &Наименование &ТипОценки &От &До Длительность: &Длительность: &Согласовано &Отказ.");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_ИсполнителиЗадачСрезПоследних.Задача КАК Ссылка,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Пользователь,
	|	cbr_ОценкаЧасовСрезПоследних.От КАК От,
	|	cbr_ОценкаЧасовСрезПоследних.До КАК До,
	|	cbr_ОценкаЧасовСрезПоследних.Длительность КАК Длительность,
	|	ВЫБОР
	|		КОГДА cbr_ОценкаЧасовСрезПоследних.Согласовано
	|			ТОГДА ""Согласовано""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Согласовано,
	|	ВЫБОР
	|		КОГДА cbr_ОценкаЧасовСрезПоследних.Отказ
	|			ТОГДА cbr_ОценкаЧасовСрезПоследних.КомментарийОтказа
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Отказ,
	|	cbr_ОценкаЧасовСрезПоследних.ТипОценки КАК ТипОценки,
	|	cbr_Задача.Наименование КАК Наименование
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ОценкаЧасов.СрезПоследних КАК cbr_ОценкаЧасовСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК
	|				cbr_ИсполнителиЗадачСрезПоследних
	|			ПО cbr_ОценкаЧасовСрезПоследних.Задача = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|		ПО cbr_ОценкаЧасовСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После удаления события");
	Триггер.Вставить("Владелец", Статусы.ВРаботе);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПередУдалениемСобытияКалендаря"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.ВРаботе));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.ВРаботе)
	|			ТОГДА 2
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Состояние,
	|	cbr_Календарь.Предмет КАК Задача
	|ПОМЕСТИТЬ вт_Состояния
	|ИЗ
	|	Справочник.cbr_Календарь КАК cbr_Календарь
	|ГДЕ
	|	cbr_Календарь.Предмет = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Календарь.Предмет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт_Состояния.Состояние, 0) КАК Состояние
	|ПОМЕСТИТЬ вт_Итоговая
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Состояния КАК вт_Состояния
	|		ПО cbr_Задача.Ссылка = вт_Состояния.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Статус КАК вт_Статус
	|		ПО cbr_Задача.Ссылка = вт_Статус.Задача
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итоговая.Ссылка КАК Ссылка,
	|	вт_Итоговая.Пользователь КАК Пользователь
	|ИЗ
	|	вт_Итоговая КАК вт_Итоговая
	|ГДЕ
	|	вт_Итоговая.Состояние = 2");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После удаления события");
	Триггер.Вставить("Владелец", Статусы.Запланирована);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПередУдалениемСобытияКалендаря"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.Запланирована));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.ВРаботе)
	|			ТОГДА 2
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Состояние,
	|	cbr_Календарь.Предмет КАК Задача
	|ПОМЕСТИТЬ вт_Состояния
	|ИЗ
	|	Справочник.cbr_Календарь КАК cbr_Календарь
	|ГДЕ
	|	cbr_Календарь.Предмет = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Календарь.Предмет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт_Состояния.Состояние, 0) КАК Состояние
	|ПОМЕСТИТЬ вт_Итоговая
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Состояния КАК вт_Состояния
	|		ПО cbr_Задача.Ссылка = вт_Состояния.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Статус КАК вт_Статус
	|		ПО cbr_Задача.Ссылка = вт_Статус.Задача
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итоговая.Ссылка КАК Ссылка,
	|	вт_Итоговая.Пользователь КАК Пользователь
	|ИЗ
	|	вт_Итоговая КАК вт_Итоговая
	|ГДЕ
	|	вт_Итоговая.Состояние = 1");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "После удаления события");
	Триггер.Вставить("Владелец", Статусы.ЗапросИнформации);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПередУдалениемСобытияКалендаря"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.НаИсполнителе));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.ВРаботе)
	|			ТОГДА 2
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Состояние,
	|	cbr_Календарь.Предмет КАК Задача
	|ПОМЕСТИТЬ вт_Состояния
	|ИЗ
	|	Справочник.cbr_Календарь КАК cbr_Календарь
	|ГДЕ
	|	cbr_Календарь.Предмет = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Календарь.Предмет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт_Состояния.Состояние, 0) КАК Состояние
	|ПОМЕСТИТЬ вт_Итоговая
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Состояния КАК вт_Состояния
	|		ПО cbr_Задача.Ссылка = вт_Состояния.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Статус КАК вт_Статус
	|		ПО cbr_Задача.Ссылка = вт_Статус.Задача
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итоговая.Ссылка КАК Ссылка,
	|	вт_Итоговая.Пользователь КАК Пользователь
	|ИЗ
	|	вт_Итоговая КАК вт_Итоговая
	|ГДЕ
	|	вт_Итоговая.Состояние = 0");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Смена исполнителя");
	Триггер.Вставить("Владелец", Статусы.Новая);
	Триггер.Вставить("Уведомлять", Истина);
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.СменаИсполнителя"));
	Триггер.Вставить("ФорматнаяСтрока", "На &Пользователь переведена задача: &Наименование");
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.cbr_ГруппыДоступаКЗадачам
	|			ТОГДА ВЫРАЗИТЬ(cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Справочник.cbr_ГруппыДоступаКЗадачам).Руководитель
	|		КОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Пользователь,
	|	cbr_ИсполнителиЗадачСрезПоследних.Задача КАК Ссылка
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_ИсполнителиЗадачСрезПоследних
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|ГДЕ
	|	НЕ cbr_ИсполнителиЗадачСрезПоследних.ЗадачаВзята");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Событие в работе");
	Триггер.Вставить("Владелец", Статусы.ВРаботе);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.ПослеЗаписиСобытияКалендаря"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.ВРаботе));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.ВРаботе)
	|			ТОГДА 2
	|		КОГДА cbr_Календарь.Состояние = ЗНАЧЕНИЕ(Перечисление.cbr_СостояниеЗаписиРабочегоКалендаря.Запланированна)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Состояние,
	|	cbr_Календарь.Предмет КАК Задача
	|ПОМЕСТИТЬ вт_Состояния
	|ИЗ
	|	Справочник.cbr_Календарь КАК cbr_Календарь
	|ГДЕ
	|	cbr_Календарь.Предмет = &Задача
	|СГРУППИРОВАТЬ ПО
	|	cbr_Календарь.Предмет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	cbr_СтатусыЗадачСрезПоследних.Статус КАК Статус
	|ПОМЕСТИТЬ вт_Статус
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК cbr_СтатусыЗадачСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(вт_Состояния.Состояние, 0) КАК Состояние
	|ПОМЕСТИТЬ вт_Итоговая
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_Состояния КАК вт_Состояния
	|		ПО cbr_Задача.Ссылка = вт_Состояния.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт_Статус КАК вт_Статус
	|		ПО cbr_Задача.Ссылка = вт_Статус.Задача
	|		И вт_Статус.Статус <> &Статус
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Итоговая.Ссылка КАК Ссылка,
	|	вт_Итоговая.Пользователь КАК Пользователь
	|ИЗ
	|	вт_Итоговая КАК вт_Итоговая
	|ГДЕ
	|	вт_Итоговая.Состояние = 2");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Триггер.Вставить("Наименование", "Исполнитель взял задачу (Менеджер взял задачу)");
	Триггер.Вставить("Владелец", Статусы.НаИсполнителе);
	Триггер.Вставить("Уведомлять", Ложь);
	Триггер.Вставить("ФорматнаяСтрока", "");
	Триггер.Вставить("Подписка", ПредопределенноеЗначение("Перечисление.cbr_ПодпискаДляТриггера.СменаИсполнителя"));
	ПараметрыТриггера.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.НаИсполнителе));
	Триггер.Вставить("Параметры", ПараметрыТриггера);
	Триггер.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Менеджер
	|ПОМЕСТИТЬ вт_Задача
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Задача.Ссылка КАК Ссылка
	|ИЗ
	|	вт_Задача КАК вт_Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_СтатусыЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|			ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ПО вт_Задача.Ссылка = cbr_СтатусыЗадачСрезПоследних.Задача
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Задача) КАК
	|			cbr_ИсполнителиЗадачСрезПоследних
	|		ПО вт_Задача.Ссылка = cbr_ИсполнителиЗадачСрезПоследних.Задача
	|		И вт_Задача.Менеджер = cbr_ИсполнителиЗадачСрезПоследних.Исполнитель
	|ГДЕ
	|	cbr_СтатусыЗадач.Ссылка <> &Статус");
	Триггеры.Добавить(Триггер);
	ПараметрыТриггера = Новый Массив;
	Триггер = Новый Структура;
	
	Возврат Триггеры;
КонецФункции

&НаСервере
Процедура СоздатьТриггеры(СтруктурыТриггеров)
	Для Каждого ДанныеТриггера Из СтруктурыТриггеров Цикл
		Триггер = Справочники.cbr_Триггеры.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Триггер, ДанныеТриггера);
		Для Каждого СтрокаПараметров Из ДанныеТриггера.Параметры Цикл
			ПараметрыЭтапа = Триггер.Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(ПараметрыЭтапа, СтрокаПараметров);
		КонецЦикла;
		Триггер.Записать();
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктурыЭтапов(Статусы)
	Этапы = Новый Массив;
	Этап = Новый Структура();
	ПараметрыЭтапа = Новый Массив;
	
	Этап.Вставить("Наименование", "Взятие задачи исполнителем");
	Этап.Вставить("Выполняется", Истина);
	Этап.Вставить("Длительность", 2);
	Этап.Вставить("Описание", "В течении х часов с момента назначения исполнителя-пользователя задача не была принята в работу");
	Этап.Вставить("Параметры", ПараметрыЭтапа);
	Этап.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель
	|		КОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.cbr_ГруппыДоступаКЗадачам
	|			ТОГДА cbr_ГруппыДоступаКЗадачам.Руководитель
	|		КОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.cbr_Роли
	|			ТОГДА ВЫБОР
	|				КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|					ТОГДА cbr_Задача.Постановщик
	|				ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|			КОНЕЦ
	|	КОНЕЦ КАК Пользователь,
	|	РАЗНОСТЬДАТ(cbr_ИсполнителиЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) КАК ВремяСНачалаЭтапа
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних КАК cbr_СтатусыЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|			ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних КАК cbr_ИсполнителиЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_ГруппыДоступаКЗадачам КАК cbr_ГруппыДоступаКЗадачам
	|			ПО cbr_ИсполнителиЗадачСрезПоследних.Исполнитель = cbr_ГруппыДоступаКЗадачам.Ссылка
	|		ПО cbr_ИсполнителиЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	НЕ cbr_СтатусыЗадач.Закрыт
	|	И НЕ cbr_ИсполнителиЗадачСрезПоследних.ЗадачаВзята
	|	И cbr_ИсполнителиЗадачСрезПоследних.ПричинаОтказа = ЗНАЧЕНИЕ(Справочник.cbr_ПричиныОтказаОтЗадачи.ПустаяСсылка)
	|	И НЕ cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ЕСТЬ NULL
	|	И РАЗНОСТЬДАТ(cbr_ИсполнителиЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) > &Длительность
	|	И cbr_Задача.Ссылка = ЕСТЬNULL(&Задача, cbr_Задача.Ссылка)");
	Этапы.Добавить(Этап);
	ПараметрыЭтапа = Новый Массив;
	Этап = Новый Структура();
	
	Этап.Вставить("Наименование", "Назначение исполнителя");
	Этап.Вставить("Выполняется", Истина);
	Этап.Вставить("Длительность", 1);
	Этап.Вставить("Описание", "В течении х часов с момента создания задачи не назначен исполнитель");
	Этап.Вставить("Параметры", ПараметрыЭтапа);
	Этап.Вставить("Запрос", "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|		ИНАЧЕ cbr_Задача.ГлавныйМенеджер
	|	КОНЕЦ КАК Пользователь,
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	РАЗНОСТЬДАТ(cbr_Задача.Дата, &ТекущаяДата, СЕКУНДА) КАК ВремяСНачалаЭтапа
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(,) КАК cbr_ИсполнителиЗадачСрезПоследних
	|		ПО cbr_ИсполнителиЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних КАК cbr_СтатусыЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|			ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	РАЗНОСТЬДАТ(cbr_Задача.Дата, &ТекущаяДата, СЕКУНДА) > &Длительность
	|	И cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ЕСТЬ NULL
	|	И cbr_Задача.Ссылка = ЕСТЬNULL(&Задача, cbr_Задача.Ссылка)");
	Этапы.Добавить(Этап);
	ПараметрыЭтапа = Новый Массив;
	Этап = Новый Структура();
	
	Этап.Вставить("Наименование", "Планирование действий");
	Этап.Вставить("Выполняется", Истина);
	Этап.Вставить("Длительность", 2);
	Этап.Вставить("Описание", "В течении х часов с момента принятия задачи исполнителем / завершения предыдущего события не запланировано новое");
	ПараметрыЭтапа.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.НаИсполнителе));
	Этап.Вставить("Параметры", ПараметрыЭтапа);
	Этап.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_Задача.Ссылка КАК Ссылка,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Пользователь,
	|	РАЗНОСТЬДАТ(cbr_ИсполнителиЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) КАК ВремяСНачалаЭтапа
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних КАК cbr_СтатусыЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_СтатусыЗадач КАК cbr_СтатусыЗадач
	|			ПО cbr_СтатусыЗадачСрезПоследних.Статус = cbr_СтатусыЗадач.Ссылка
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних КАК cbr_ИсполнителиЗадачСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_ГруппыДоступаКЗадачам КАК cbr_ГруппыДоступаКЗадачам
	|			ПО cbr_ИсполнителиЗадачСрезПоследних.Исполнитель = cbr_ГруппыДоступаКЗадачам.Ссылка
	|		ПО cbr_ИсполнителиЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	НЕ cbr_СтатусыЗадач.Закрыт
	|	И cbr_ИсполнителиЗадачСрезПоследних.ЗадачаВзята
	|	И cbr_ИсполнителиЗадачСрезПоследних.ПричинаОтказа = ЗНАЧЕНИЕ(Справочник.cbr_ПричиныОтказаОтЗадачи.ПустаяСсылка)
	|	И cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.Пользователи
	|	И cbr_СтатусыЗадачСрезПоследних.Статус = &Статус
	|	И РАЗНОСТЬДАТ(cbr_СтатусыЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) > &Длительность
	|	И cbr_Задача.Ссылка = ЕСТЬNULL(&Задача, cbr_Задача.Ссылка)");
	Этапы.Добавить(Этап);
	ПараметрыЭтапа = Новый Массив;
	Этап = Новый Структура();
	
	Этап.Вставить("Наименование", "Согласование оценки");
	Этап.Вставить("Выполняется", Истина);
	Этап.Вставить("Длительность", 72);
	Этап.Вставить("Описание", "В течении х часов после запроса исполнителя, менеджер должен согласовать оценку задачи");
	ПараметрыЭтапа.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.НаМенеджере));
	Этап.Вставить("Параметры", ПараметрыЭтапа);
	Этап.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Ссылка,
	|	РАЗНОСТЬДАТ(cbr_СтатусыЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) КАК ВремяСНачалаЭтапа,
	|	ВЫБОР
	|		КОГДА cbr_Задача.ГлавныйМенеджер ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.ГлавныйМенеджер
	|		ИНАЧЕ cbr_Задача.Постановщик
	|	КОНЕЦ КАК Пользователь
	|ИЗ
	|	РегистрСведений.cbr_СтатусыЗадач.СрезПоследних КАК cbr_СтатусыЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_Задача КАК cbr_Задача
	|		ПО cbr_СтатусыЗадачСрезПоследних.Задача = cbr_Задача.Ссылка
	|ГДЕ
	|	cbr_СтатусыЗадачСрезПоследних.Статус = &Статус
	|	И РАЗНОСТЬДАТ(cbr_СтатусыЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) > &Длительность
	|	И cbr_СтатусыЗадачСрезПоследних.Задача = ЕСТЬNULL(&Задача, cbr_СтатусыЗадачСрезПоследних.Задача)");
	Этапы.Добавить(Этап);
	ПараметрыЭтапа = Новый Массив;
	Этап = Новый Структура();
	
	Этап.Вставить("Наименование", "Ответ на вопрос");
	Этап.Вставить("Выполняется", Истина);
	Этап.Вставить("Длительность", 2);
	Этап.Вставить("Описание", "В течении х часов с момента постановки вопроса по задаче на него должен быть дан ответ");
	ПараметрыЭтапа.Добавить(Новый Структура("Параметр,Значение", "Статус", Статусы.ЗапросИнформации));
	Этап.Вставить("Параметры", ПараметрыЭтапа);
	Этап.Вставить("Запрос", "ВЫБРАТЬ
	|	cbr_СтатусыЗадачСрезПоследних.Задача КАК Задача,
	|	РАЗНОСТЬДАТ(cbr_СтатусыЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) КАК ВремяСНачалаЭтапа,
	|	МАКСИМУМ(cbr_ВопросыПоЗадачам.Дата) КАК Дата
	|ПОМЕСТИТЬ вт_ДатыПоследнихВопросов
	|ИЗ
	|	РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_СтатусыЗадач.СрезПоследних КАК cbr_СтатусыЗадачСрезПоследних
	|		ПО cbr_ВопросыПоЗадачам.Задача = cbr_СтатусыЗадачСрезПоследних.Задача
	|ГДЕ
	|	cbr_СтатусыЗадачСрезПоследних.Статус = &Статус
	|	И РАЗНОСТЬДАТ(cbr_СтатусыЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА) > &Длительность
	|	И cbr_ВопросыПоЗадачам.ВидВопроса = ЗНАЧЕНИЕ(Перечисление.cbr_ВидыВопросов.Вопрос)
	|	И cbr_ВопросыПоЗадачам.Задача = ЕСТЬNULL(&Задача, cbr_ВопросыПоЗадачам.Задача)
	|СГРУППИРОВАТЬ ПО
	|	cbr_СтатусыЗадачСрезПоследних.Задача,
	|	РАЗНОСТЬДАТ(cbr_СтатусыЗадачСрезПоследних.Период, &ТекущаяДата, СЕКУНДА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ДатыПоследнихВопросов.Задача КАК Ссылка,
	|	вт_ДатыПоследнихВопросов.ВремяСНачалаЭтапа КАК ВремяСНачалаЭтапа,
	|	cbr_ВопросыПоЗадачам.Адресат КАК Пользователь
	|ИЗ
	|	вт_ДатыПоследнихВопросов КАК вт_ДатыПоследнихВопросов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.cbr_ВопросыПоЗадачам КАК cbr_ВопросыПоЗадачам
	|		ПО вт_ДатыПоследнихВопросов.Задача = cbr_ВопросыПоЗадачам.Задача
	|		И вт_ДатыПоследнихВопросов.Дата = cbr_ВопросыПоЗадачам.Дата");
	Этапы.Добавить(Этап);
	ПараметрыЭтапа = Новый Массив;
	Этап = Новый Структура();
	
	Возврат Этапы;
КонецФункции

&НаСервере
Процедура СоздатьЭтапы(СтруктурыЭтапов)
	Для Каждого ДанныеЭтапа Из СтруктурыЭтапов Цикл
		Этап = Справочники.cbr_КонтрольНадЭтапамиЗадач.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(Этап, ДанныеЭтапа);
		Для Каждого СтрокаПараметров Из ДанныеЭтапа.Параметры Цикл
			ПараметрыЭтапа = Этап.Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(ПараметрыЭтапа, СтрокаПараметров);
		КонецЦикла;
		Этап.Записать();
	КонецЦикла;	
КонецПроцедуры
#КонецОбласти
